<?php
/**
 * Created by PhpStorm.
 * author: Harris
 * Date: 5/7/2019
 * Time: 8:23 PM
 */

return [
    //AuthController
    '100001' => '您没有访问权限',
    '100002' => '账号密码错误',
    '100003' => '旧密码不匹配',
    '100004' => '没有此用户',
    '100005' => '你已多次登录展示不能登录',
    '100006' => '用户不存在',
    '100007' => '新密码与旧密码相同',
    '100008' => '两次密码不一致',
    '100009' => '原密码不正确',
    '100010' => 'type非法',
    '100011' => '修改密码失败',
    //UserHandleController
    '100100' => '更改密码已有申请',
    '100101' => '更改资金密码已有申请',
    '100102' => '没有此条信息',
];
